Stable/Base_Cases_Stable_Lubrication/Base_Case_Stable/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    freeSurface
    {
    	 type		totalPressure;
    	 p0		uniform 0;	
    }
    
    ".*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
}


// ************************************************************************* //
